{
    "_metadata":  {
                      "schema_version":  "2.0",
                      "file_type":  "framework_data",
                      "last_updated":  "2025-12-15",
                      "context":  "Integrated Framework for Inquiry and Creation"
                  },
    "toolId":  "tool10",
    "toolName":  "Orchestrate the System",
    "concepts":  [
                     {
                         "id":  "T10.1",
                         "name":  "Adaptation",
                         "integrated_deliverable":  "A Post-Project Change Log.",
                         "scenario":  "Responding to a market shift.",
                         "theory_application":  "Adjust to new conditions or information.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Manager",
                                                "theory":  "Definition: Adaptation is the conscious decision to switch methods. Procedural Link: The action is to make the conscious decision to switch experimental methods or analytical approaches in response to unexpected data or resource changes.",
                                                "specific_deliverable":  "A Change Request.",
                                                "rubric":  "Consciously switch methods."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "David Snowden - The Strategist",
                                                "theory":  "Definition: Adaptation is the ability to adjust process. Procedural Link: The action is to ensure the core principle of Agile; the ability to adjust priorities, scope, or process in response to new information (Inspect and Adapt).",
                                                "specific_deliverable":  "A Pivot Plan.",
                                                "rubric":  "Adjust process."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Team",
                                                "theory":  "Definition: Adaptation is modifying the writing process. Procedural Link: The action is to modify the writing process, schedule, or research method based on a review of the work\u0027s process log.",
                                                "specific_deliverable":  "A Process Update.",
                                                "rubric":  "Modify writing process."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Liz Lerman - The Artist",
                                                "theory":  "Definition: Adaptation is changing the studio workflow. Procedural Link: The action is to change the studio workflow, material, or approach in response to a process critique.",
                                                "specific_deliverable":  "A Workflow Diagram.",
                                                "rubric":  "Change studio workflow."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Donella Meadows - The Leader",
                                                "theory":  "Definition: Adaptation is adjusting governance. Procedural Link: The action is to ensure the capacity of the organization or community to adjust its governance in response to emergent social or environmental needs.",
                                                "specific_deliverable":  "A Policy Revision.",
                                                "rubric":  "Adjust governance."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.2",
                         "name":  "Awareness",
                         "integrated_deliverable":  "A Metacognitive Log.",
                         "scenario":  "Improving team communication.",
                         "theory_application":  "Cultivate conscious attention to internal and external states.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Facilitator",
                                                "theory":  "Definition: Awareness is attention to process and bias. Procedural Link: The action is to cultivate the metacognitive state of being consciously attentive to one\u0027s research process, cognitive biases, and time allocation.",
                                                "specific_deliverable":  "A Meeting Log.",
                                                "rubric":  "Attention to process/bias."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Manager",
                                                "theory":  "Definition: Awareness is collective awareness of process health. Procedural Link: The action is to cultivate the collective awareness of the team\u0027s process health, including flow efficiency, work-in-progress limits, and morale.",
                                                "specific_deliverable":  "A Team Health Check.",
                                                "rubric":  "Collective awareness of health."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Coach",
                                                "theory":  "Definition: Awareness is self-awareness of habits. Procedural Link: The action is to cultivate the writer’s self-awareness of their own writing habits, procrastination triggers, and argument flaws.",
                                                "specific_deliverable":  "A Personal Journal.",
                                                "rubric":  "Self-awareness of habits."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Mihaly Csikszentmihalyi - The Member",
                                                "theory":  "Definition: Awareness is understanding creative flow. Procedural Link: The action is to cultivate the artist’s metacognitive understanding of their creative flow, personal aesthetic rules, and recurring creative blocks.",
                                                "specific_deliverable":  "A Flow Log.",
                                                "rubric":  "Understanding creative flow."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Paulo Freire - The Leader",
                                                "theory":  "Definition: Awareness is communal self-awareness. Procedural Link: The action is to cultivate communal self-awareness of the group\u0027s current emotional state, power dynamics, and adherence to principles.",
                                                "specific_deliverable":  "A Feedback Summary.",
                                                "rubric":  "Communal self-awareness."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.3",
                         "name":  "Contemplation",
                         "integrated_deliverable":  "A Reflection Period Report.",
                         "scenario":  "Taking a sabbatical.",
                         "theory_application":  "Engage in deep, sustained thought or reflection.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Thinker",
                                                "theory":  "Definition: Contemplation is quiet reflection. Procedural Link: The action is to schedule deliberate, quiet time to reflect on complex data or paradoxes to allow deeper insights to emerge.",
                                                "specific_deliverable":  "A Reading List.",
                                                "rubric":  "Quiet reflection."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Planner",
                                                "theory":  "Definition: Contemplation is strategic reflection. Procedural Link: The action is to set aside time for strategic reflection outside of the immediate pressures of feature delivery (Consolidation Period - N97).",
                                                "specific_deliverable":  "A Vision Board.",
                                                "rubric":  "Strategic reflection."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Writer",
                                                "theory":  "Definition: Contemplation is sustained, quiet thought. Procedural Link: The action is to engage in sustained, quiet thought about a dense passage or theoretical problem.",
                                                "specific_deliverable":  "A Draft Essay.",
                                                "rubric":  "Sustained quiet thought."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "John Cage - The Artist",
                                                "theory":  "Definition: Contemplation is meditative practice. Procedural Link: The action is to engage in the meditative practice of giving undivided attention to the creative process or the finished work.",
                                                "specific_deliverable":  "A Sketchbook.",
                                                "rubric":  "Meditative practice."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "M. M. Bakhtin - The Traveler",
                                                "theory":  "Definition: Contemplation is self-inquiry. Procedural Link: The action is to engage in the practice of Self-Inquiry (N81), turning attention inward to diagnose one\u0027s motivations and attachments.",
                                                "specific_deliverable":  "A Travel Journal.",
                                                "rubric":  "Self-inquiry."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.4",
                         "name":  "Double-Loop Learning",
                         "integrated_deliverable":  "A Systemic Flaw Report.",
                         "scenario":  "Fixing a recurring error.",
                         "theory_application":  "Question underlying assumptions and goals, rather than just adjusting actions.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Chris Argyris - The Analyst",
                                                "theory":  "Definition: Double-loop learning is questioning the underlying assumption. Procedural Link: The goal is to go beyond fixing a flawed experimental outcome (single-loop) to questioning the underlying scientific assumption or flawed theory (double-loop).",
                                                "specific_deliverable":  "A Root Cause Analysis.",
                                                "rubric":  "Question underlying assumption."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Chris Argyris - The Manager",
                                                "theory":  "Definition: Double-loop learning is questioning the underlying process. Procedural Link: The goal is to go beyond fixing a bug (single-loop) to questioning the underlying process or flawed assumption that caused it. (Ref: Argyris, 1991)",
                                                "specific_deliverable":  "A Process Map.",
                                                "rubric":  "Question underlying process."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Chris Argyris - The Consultant",
                                                "theory":  "Definition: Double-loop learning is questioning the underlying framework. Procedural Link: The goal is to go beyond fixing a logical error to questioning the underlying theoretical framework that created the error.",
                                                "specific_deliverable":  "A Strategy Review.",
                                                "rubric":  "Question underlying framework."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Chris Argyris - The Designer",
                                                "theory":  "Definition: Double-loop learning is questioning the fundamental philosophy. Procedural Link: The goal is to go beyond fixing a failed design to questioning the fundamental design philosophy that led to the attempt.",
                                                "specific_deliverable":  "A Design Critique.",
                                                "rubric":  "Question fundamental philosophy."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Chris Argyris - The Leader",
                                                "theory":  "Definition: Double-loop learning is questioning core beliefs. Procedural Link: The action is to question the core communal beliefs or values that led to a negative systemic outcome.",
                                                "specific_deliverable":  "A Values Audit.",
                                                "rubric":  "Question core beliefs."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.5",
                         "name":  "Inventory",
                         "integrated_deliverable":  "A Status Report.",
                         "scenario":  "Taking stock of resources.",
                         "theory_application":  "Systematically count and assess available resources or assets.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Manager",
                                                "theory":  "Definition: Inventory is taking stock of the project\u0027s status. Procedural Link: The action is to take stock of the project\u0027s current status: what data is collected, what code is deployed, and what problems remain.",
                                                "specific_deliverable":  "An Inventory List.",
                                                "rubric":  "Take stock of status."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Planner",
                                                "theory":  "Definition: Inventory is reviewing backlog and counting resources. Procedural Link: The action is to review the current state of the backlog, identifying bottlenecks, and counting the resources consumed (e.g., measuring Cycle Time - N105).",
                                                "specific_deliverable":  "A Resource Plan.",
                                                "rubric":  "Review backlog."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Analyst",
                                                "theory":  "Definition: Inventory is reviewing written prose and research needed. Procedural Link: The action is to review the amount of written prose, collected fieldwork, and remaining research needed for completion.",
                                                "specific_deliverable":  "A Gap Analysis.",
                                                "rubric":  "Review prose/research."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Richard Sennett - The Curator",
                                                "theory":  "Definition: Inventory is cataloging assets. Procedural Link: The action is to catalog all sketches, models, materials, and digital assets.",
                                                "specific_deliverable":  "A Collection Log.",
                                                "rubric":  "Catalog assets."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Jürgen Habermas - The Auditor",
                                                "theory":  "Definition: Inventory is a formal check-in on commitments. Procedural Link: The action is to conduct a formal check-in on the status of all ethical commitments and community relationships.",
                                                "specific_deliverable":  "A Compliance Report.",
                                                "rubric":  "Check-in on commitments."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.6",
                         "name":  "Metacognition",
                         "integrated_deliverable":  "A Process Improvement Plan.",
                         "scenario":  "Improving personal productivity.",
                         "theory_application":  "Think about thinking; monitor and regulate one\u0027s own cognitive processes.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Thinker",
                                                "theory":  "Definition: Metacognition is conscious reflection on the process. Procedural Link: The action is to engage in the conscious reflection on the process of scientific thinking and problem-solving to improve efficiency and reduce bias.",
                                                "specific_deliverable":  "A Learning Log.",
                                                "rubric":  "Conscious reflection on process."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Coach",
                                                "theory":  "Definition: Metacognition is diagnosing the workflow. Procedural Link: The action is to engage in the practice of thinking about thinking: diagnosing the workflow itself (e.g., why is this slow? where are we stuck?).",
                                                "specific_deliverable":  "A Time Audit.",
                                                "rubric":  "Diagnose workflow."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Practitioner",
                                                "theory":  "Definition: Metacognition is self-reflection on the drafting process. Procedural Link: The action is to engage in the writer’s self-reflection on their drafting process, focusing on habits and cognitive blocks.",
                                                "specific_deliverable":  "A Writing Journal.",
                                                "rubric":  "Self-reflection on drafting."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Mihaly Csikszentmihalyi - The Artist",
                                                "theory":  "Definition: Metacognition is articulating tacit rules. Procedural Link: The action is to engage in the artist’s ability to articulate the tacit rules that guide their creative, intuitive process.",
                                                "specific_deliverable":  "A Creative Manifesto.",
                                                "rubric":  "Articulate tacit rules."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Paulo Freire - The Student",
                                                "theory":  "Definition: Metacognition is the highest state of self-awareness. Procedural Link: The action is to engage in the highest state of self-awareness and control over one\u0027s own cognitive and moral conduct.",
                                                "specific_deliverable":  "A Personal Development Plan.",
                                                "rubric":  "Highest state of self-awareness."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.7",
                         "name":  "Observation",
                         "integrated_deliverable":  "A Monitoring Report.",
                         "scenario":  "Monitoring a live system.",
                         "theory_application":  "Watch and record behavior or performance without interfering.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Engineer",
                                                "theory":  "Definition: Observation is monitoring system performance. Procedural Link: The action is to monitor system performance metrics, error rates, and the behavior of the research team.",
                                                "specific_deliverable":  "A Dashboard.",
                                                "rubric":  "Monitor system performance."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Admin",
                                                "theory":  "Definition: Observation is monitoring communication patterns. Procedural Link: The action is to monitor the Kanban board (N103), Burndown charts, and team communication patterns for signs of friction.",
                                                "specific_deliverable":  "A Traffic Log.",
                                                "rubric":  "Monitor communication patterns."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Analyst",
                                                "theory":  "Definition: Observation is observing group engagement. Procedural Link: The action is to ensure the writer or group leader observes the group’s engagement and emotional state during a writing session.",
                                                "specific_deliverable":  "A User Activity Report.",
                                                "rubric":  "Observe group engagement."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Richard Sennett - The Observer",
                                                "theory":  "Definition: Observation is viewing work as an outsider. Procedural Link: The action is to ensure the artist views their work as an outsider, detaching from their own expectation to see true flaws.",
                                                "specific_deliverable":  "A Critique.",
                                                "rubric":  "View work as outsider."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Jürgen Habermas - The Witness",
                                                "theory":  "Definition: Observation is intentional witnessing. Procedural Link: The action is to engage in the intentional, non-judgmental witnessing of a social ritual or interaction.",
                                                "specific_deliverable":  "A Testimony.",
                                                "rubric":  "Intentional witnessing."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.8",
                         "name":  "Oversight",
                         "integrated_deliverable":  "A Portfolio Review Deck.",
                         "scenario":  "Managing a department budget.",
                         "theory_application":  "Supervise and manage a system or process to ensure it meets its goals.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Director",
                                                "theory":  "Definition: Oversight is strategic management of the system. Procedural Link: The action is to fulfill the strategic, leadership function of managing the entire inquiry system across multiple cycles and teams.",
                                                "specific_deliverable":  "A Budget Report.",
                                                "rubric":  "Strategic management of system."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Manager",
                                                "theory":  "Definition: Oversight is managing the product portfolio. Procedural Link: The action is to fulfill the executive function of managing the whole product portfolio, allocating resources, and selecting which initiatives to fund next (Portfolio Review - N99).",
                                                "specific_deliverable":  "A Resource Allocation Plan.",
                                                "rubric":  "Manage product portfolio."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Lead",
                                                "theory":  "Definition: Oversight is steering the intellectual trajectory. Procedural Link: The action is to fulfill the role of head of a department or research center steering the intellectual trajectory and managing the collective academic work.",
                                                "specific_deliverable":  "A Strategic Plan.",
                                                "rubric":  "Steer intellectual trajectory."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Mihaly Csikszentmihalyi - The Executive",
                                                "theory":  "Definition: Oversight is managing creative output. Procedural Link: The action is to fulfill the leadership role of an artistic director managing the creative output of a studio or company.",
                                                "specific_deliverable":  "A Production Schedule.",
                                                "rubric":  "Manage creative output."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Paulo Freire - The Board",
                                                "theory":  "Definition: Oversight is ultimate leadership responsibility. Procedural Link: The action is to fulfill the ultimate leadership responsibility for the health and sustainability of the community.",
                                                "specific_deliverable":  "An Annual Review.",
                                                "rubric":  "Ultimate leadership responsibility."
                                            },
                                            {
                                                "domain":  "Complexity Science",
                                                "rubric":  "Manages boundaries/interactions.",
                                                "specific_deliverable":  "A CAS Intervention Plan.",
                                                "expert":  "DASSM",
                                                "theory":  "Complex Adaptive Systems (CAS). Procedural Link: Treat the team as a semi-autonomous system; manage boundaries, not individuals."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.9",
                         "name":  "Process Improvement",
                         "integrated_deliverable":  "A System Change Proposal.",
                         "scenario":  "Reducing wait times.",
                         "theory_application":  "Identify and implement changes to a process to improve its efficiency or effectiveness.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Engineer",
                                                "theory":  "Definition: Process improvement is preventing recurring errors. Procedural Link: The action is to implement changes to protocols, lab structures, or data handling techniques to prevent recurring errors.",
                                                "specific_deliverable":  "A Process Flowchart.",
                                                "rubric":  "Prevent recurring errors."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Taiichi Ohno - The Manager",
                                                "theory":  "Definition: Process improvement is reducing waste. Procedural Link: The action is to implement systemic changes (e.g., implementing WIP limits - N104, defining new APIs) to reduce waste and bottlenecks.",
                                                "specific_deliverable":  "A Value Stream Map.",
                                                "rubric":  "Reduce waste."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Consultant",
                                                "theory":  "Definition: Process improvement is developing new protocols. Procedural Link: The action is to develop new writing protocols or collaborative research methods based on lessons learned from past projects.",
                                                "specific_deliverable":  "A Standard Work Doc.",
                                                "rubric":  "Develop new protocols."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Richard Sennett - The Designer",
                                                "theory":  "Definition: Process improvement is developing new heuristics. Procedural Link: The action is to develop new studio routines or heuristics (N77) to overcome chronic creative blocks.",
                                                "specific_deliverable":  "A Best Practices Guide.",
                                                "rubric":  "Develop new heuristics."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Jürgen Habermas - The Leader",
                                                "theory":  "Definition: Process improvement is changing governance structure. Procedural Link: The action is to implement a systemic, long-term change to the governance or communication structure to improve collaboration.",
                                                "specific_deliverable":  "A Policy Change Memo.",
                                                "rubric":  "Change governance structure."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.10",
                         "name":  "Reflection",
                         "integrated_deliverable":  "A Formal Review Document.",
                         "scenario":  "Conducting a quarterly review.",
                         "theory_application":  "Look back on a period of time or an event to evaluate what happened and why.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Manager",
                                                "theory":  "Definition: Reflection is formally reviewing the past cycle. Procedural Link: The action is to engage in the activity of formally reviewing the past cycle to extract non-obvious lessons (e.g., Lab Meeting - N70).",
                                                "specific_deliverable":  "A Performance Report.",
                                                "rubric":  "Formally review past cycle."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Team",
                                                "theory":  "Definition: Reflection is inspecting process health. Procedural Link: The action is to engage in the formal team ceremony of the Sprint Retrospective (N44) for inspecting process health.",
                                                "specific_deliverable":  "A Start/Stop/Continue List.",
                                                "rubric":  "Inspect process health."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Individual",
                                                "theory":  "Definition: Reflection is systematically questioning past events. Procedural Link: The action is to engage in the core of reflective practice (N74); systematically questioning past events to transform tacit experience into explicit knowledge.",
                                                "specific_deliverable":  "A Self-Evaluation.",
                                                "rubric":  "Systematically question past events."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Liz Lerman - The Group",
                                                "theory":  "Definition: Reflection is analyzing the artistic workflow. Procedural Link: The action is to engage in the Process Critique (N76) where the artistic workflow is analyzed as a system to be improved.",
                                                "specific_deliverable":  "A Critique Summary.",
                                                "rubric":  "Analyze artistic workflow."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Paulo Freire - The Community",
                                                "theory":  "Definition: Reflection is the deliberate pause. Procedural Link: The action is to engage in the deliberate pause to review recent communal actions against core values.",
                                                "specific_deliverable":  "A Meeting Minutes.",
                                                "rubric":  "Deliberate pause."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.11",
                         "name":  "Reflective Practice",
                         "integrated_deliverable":  "A Professional Development Plan.",
                         "scenario":  "Planning career growth.",
                         "theory_application":  "Engage in a continuous cycle of action and reflection to improve performance and understanding.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Donald Schön - The Professional",
                                                "theory":  "Definition: Reflective practice is translating experience into expertise. Procedural Link: The action is to engage in the discipline of consistently reviewing one\u0027s own actions and processes to translate individual experience into professional expertise. (N74)",
                                                "specific_deliverable":  "A Skill Gap Analysis.",
                                                "rubric":  "Translate experience into expertise."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Chris Argyris - The Employee",
                                                "theory":  "Definition: Reflective practice is analyzing contributions to performance. Procedural Link: The action is to engage in the professional habit of continuously analyzing one\u0027s own contributions to team performance and process friction.",
                                                "specific_deliverable":  "A Goal Setting Sheet.",
                                                "rubric":  "Analyze contributions to performance."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Mentor",
                                                "theory":  "Definition: Reflective practice is systematic self-analysis. Procedural Link: The action is to engage in the systematic self-analysis by the scholar to understand how their background and biases influence their research design.",
                                                "specific_deliverable":  "A Journal Entry.",
                                                "rubric":  "Systematic self-analysis."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Richard Sennett - The Apprentice",
                                                "theory":  "Definition: Reflective practice is maintaining a process journal. Procedural Link: The action is to engage in the artist\u0027s disciplined maintenance of a Process Journal (N31) to record insights and process changes.",
                                                "specific_deliverable":  "A Learning Log.",
                                                "rubric":  "Maintain process journal."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Paulo Freire - The Leader",
                                                "theory":  "Definition: Reflective practice is integrating experience and integrated knowledge. Procedural Link: The action is to engage in the lifelong discipline of integrating experience and integrated knowledge into ethical action.",
                                                "specific_deliverable":  "A Personal Mission Statement.",
                                                "rubric":  "Integrate experience and integrated knowledge."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.12",
                         "name":  "Retrospective",
                         "integrated_deliverable":  "A Formal Retrospective Report.",
                         "scenario":  "Closing a project phase.",
                         "theory_application":  "Look back on a completed phase of work to identify lessons learned and improve future performance.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Taiichi Ohno - The Facilitator",
                                                "theory":  "Definition: Retrospective is analyzing the process of the experiment. Procedural Link: The action is to engage in a formal, time-boxed meeting to collectively analyze the past work cycle\u0027s process, identifying flaws in the protocol or teamwork that should be fixed for the next cycle. (N44)",
                                                "specific_deliverable":  "A Process Review.",
                                                "rubric":  "Analyze process of experiment."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Team",
                                                "theory":  "Definition: Retrospective is inspecting process health. Procedural Link: The action is to engage in the formal team ceremony of the Sprint Retrospective (N44) for inspecting process health.",
                                                "specific_deliverable":  "A Start/Stop/Continue List.",
                                                "rubric":  "Inspect process health."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Manager",
                                                "theory":  "Definition: Retrospective is distilling key learnings. Procedural Link: The action is to engage in a structured meeting for a Writing Group (N73) to discuss progress, troubleshoot process blocks, and commit to next steps. Procedural Link: The action is to engage in a structured meeting for a Writing Group (N73) to discuss progress, troubleshoot process blocks, and commit to next steps.",
                                                "specific_deliverable":  "A Lessons Learned Doc.",
                                                "rubric":  "Distill key learnings."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Liz Lerman - The Group",
                                                "theory":  "Definition: Retrospective is analyzing the artistic workflow. Procedural Link: The action is to engage in a Studio Critique (N76) focused on the efficiency, coherence, and principles of the creative process.",
                                                "specific_deliverable":  "A Critique Notes.",
                                                "rubric":  "Analyze artistic workflow."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Jürgen Habermas - The Council",
                                                "theory":  "Definition: Retrospective is facilitated dialogue. Procedural Link: The action is to engage in a facilitated Council (N65) or dialogue session to reflect on collective actions and reaffirm shared agreements.",
                                                "specific_deliverable":  "A Meeting Summary.",
                                                "rubric":  "Facilitated dialogue."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.13",
                         "name":  "Self-Regulation",
                         "integrated_deliverable":  "A Personal/Team Capacity Report.",
                         "scenario":  "A research team facing burnout during a long trial.",
                         "theory_application":  "Monitor and control one\u0027s own behavior, emotions, and thoughts to achieve a goal.",
                         "variations":  [
                                            {
                                                "domain":  "Science",
                                                "expert":  "Richard Feynman - The Scientist",
                                                "theory":  "Definition: Self-regulation is managing attention and bias. Procedural Link: The action is to aim for the capacity of the scientist to manage their own attention, biases, and emotional responses to data to maintain objectivity.",
                                                "specific_deliverable":  "A Bias Check Log.",
                                                "rubric":  "Aims to maintain objectivity via regulation."
                                            },
                                            {
                                                "domain":  "Business",
                                                "expert":  "Jeff Sutherland - The Coach",
                                                "theory":  "Definition: Self-regulation is diagnosing and fixing process. Procedural Link: The action is to aim for the capacity of the team to diagnose and fix its own process without external help (the self-managing team).",
                                                "specific_deliverable":  "A Velocity Adjustment Plan.",
                                                "rubric":  "Aims to diagnose/fix process autonomously."
                                            },
                                            {
                                                "domain":  "Humanities",
                                                "expert":  "Donald Schön - The Practitioner",
                                                "theory":  "Definition: Self-regulation is managing motivation and argument development. Procedural Link: The action is to aim for the scholar’s ability to manage procrastination, motivation, and argument development autonomously.",
                                                "specific_deliverable":  "A Motivation Audit.",
                                                "rubric":  "Aims to manage work autonomously."
                                            },
                                            {
                                                "domain":  "Arts",
                                                "expert":  "Mihaly Csikszentmihalyi - The Artist",
                                                "theory":  "Definition: Self-regulation is command over tools and focus. Procedural Link: The action is to aim for the artist\u0027s complete command over their tools, habits, and focus to achieve flow state and sustained creativity.",
                                                "specific_deliverable":  "A Flow State Protocol.",
                                                "rubric":  "Aims for flow state and sustained creativity."
                                            },
                                            {
                                                "domain":  "Culture",
                                                "expert":  "Paulo Freire - The Leader",
                                                "theory":  "Definition: Self-regulation is governing oneself. Procedural Link: The action is to aim for the capacity of the individual and community to govern themselves according to integrated values and integrated knowledge.",
                                                "specific_deliverable":  "A Leadership Self-Care Pledge.",
                                                "rubric":  "Aims to govern themselves via values."
                                            }
                                        ]
                     },
                     {
                         "id":  "T10.14",
                         "name":  "Tuckman\u0027s Stages",
                         "integrated_deliverable":  "A Team Maturity Assessment.",
                         "variations":  [
                                            {
                                                "expert":  "Bruce Tuckman",
                                                "domain":  "Project Management",
                                                "theory":  "Teams must go through conflict (Storming) to reach performance. Procedural Link: Diagnose the current stage and apply \u0027Directive\u0027 or \u0027Supportive\u0027 leadership accordingly.",
                                                "specific_deliverable":  "A Leadership Adjustment Plan.",
                                                "rubric":  "Diagnoses stage/adjusts style."
                                            }
                                        ],
                         "scenario":  "A new team is fighting constantly.",
                         "theory_application":  "Diagnose team maturity (Forming, Storming, Norming, Performing) to select the right leadership style."
                     },
                     {
                         "id":  "T10.15",
                         "name":  "Kotter / ADKAR",
                         "integrated_deliverable":  "A Change Management Plan.",
                         "variations":  [
                                            {
                                                "expert":  "Prosci / Kotter",
                                                "domain":  "Change Management",
                                                "theory":  "Change happens at the individual level (Awareness, Desire, Knowledge, Ability, Reinforcement). Procedural Link: Assess the team\u0027s ADKAR status and intervene where they are stuck.",
                                                "specific_deliverable":  "An ADKAR Assessment.",
                                                "rubric":  "Addresses human side of change."
                                            }
                                        ],
                         "scenario":  "Implementing a new software system.",
                         "theory_application":  "Manage the human side of organizational change using a structured model."
                     },
                     {
                         "id":  "T10.16",
                         "name":  "Operations Research",
                         "integrated_deliverable":  "An Optimization Model.",
                         "variations":  [
                                            {
                                                "expert":  "Linear Programming",
                                                "domain":  "Industrial Engineering",
                                                "theory":  "Optimization. Procedural Link: Use mathematical modeling to maximize efficiency under constraints.",
                                                "specific_deliverable":  "A Linear Optimization Model.",
                                                "rubric":  "Uses math to optimize."
                                            }
                                        ],
                         "scenario":  "Optimizing delivery routes.",
                         "theory_application":  "Use advanced analytical methods to help make better decisions."
                     },
                     {
                         "id":  "T10.VC.1",
                         "name":  "Value Chain Analysis",
                         "integrated_deliverable":  "A Process Optimization Report.",
                         "variations":  [
                                            {
                                                "expert":  "Michael Porter",
                                                "domain":  "Business",
                                                "theory":  "Value Chain. Link: Map Primary vs. Support activities to find margin.",
                                                "specific_deliverable":  "Efficiency Audit",
                                                "rubric":  "Identifies friction points."
                                            },
                                            {
                                                "expert":  "Donella Meadows",
                                                "domain":  "Systems Thinking",
                                                "theory":  "Flow Analysis. Link: Identify where the \u0027stock\u0027 of knowledge gets stuck in the \u0027pipes\u0027 of process.",
                                                "specific_deliverable":  "Flow Map",
                                                "rubric":  "Identifies bottlenecks."
                                            }
                                        ],
                         "scenario":  "A team feeling busy but producing little value.",
                         "theory_application":  "Analyze the workflow to identify where value is created and where it is lost (friction), then optimize the chain."
                     }
                 ]
}